# RemoveTagWithNoLeaders Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..TagFailures..::..RemoveTagWithNoLeaders Property
BuiltInFailures..::..TagFailures Class See Also
---
The Tag was deleted because it was no longer pointing to any elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RemoveTagWithNoLeaders { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RemoveTagWithNoLeaders As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RemoveTagWithNoLeaders {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..TagFailures Class
Autodesk.Revit.DB Namespace